IDEA StatiCa Open Model
Segment2D Constructor
Compatible with IDEA StatiCa Beta 21.0 - beta
Initializes a new instance of the Segment2D class
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
protected Segment2D()
Protected Sub New
protected:
Segment2D()
See Also
Reference
Segment2D Class
IdeaRS.OpenModel.Geometry2D Namespace